IMS_RAILS/app/controllers/candidate_controller.rb

  def index
    @interviews = Interview.all
---
SELECT * FROM `interviews`