IMS_RAILS/app/controllers/import_candidates_controller.rb

  def index
    @import_candidates = ImportCandidate.all
---
SELECT * FROM `import_candidates`

  def csv_import
      file = params[:csv_import][:file]
      logcount=0
      Interview.transaction do
        FasterCSV.parse(file, :headers => true) do |row|
          Interview.create!(row.to_hash)
---
INSERT INTO `interviews` (`name`, `result`, `created_at`, `remarks`, `photo_file_size`, `updated_at`, `photo_file_name`, `photo_content_type`, `phoneNumber`, `total_exp`, `type_location`, `doi`, `ror_exp`, `email`) VALUES('ashish', 'Pass', '2011-05-09 06:50:14', 'Good', NULL, '2011-05-09 06:50:14', NULL, NULL, 9920149993, '3', 'Mumbai', '2011-02-22', 'Java', 'zapper320@gmail.com')