IMS_RAILS/app/controllers/interviews_controller.rb

SELECT * FROM `interviews` WHERE (`interviews`.`id` = 1)
---
  def show
    @interview = Interview.find(params[:id])

SELECT * FROM `interviews` WHERE (`interviews`.`id` = 2)
---
  def edit
    @interview = Interview.find(params[:id])

INSERT INTO `interviews` (`name`, `result`, `created_at`, `remarks`, `photo_file_size`, `updated_at`, `photo_file_name`, `photo_content_type`, `phoneNumber`, `id`, `total_exp`, `type_location`, `doi`, `ror_exp`, `email`) VALUES('ashish', 'Pass', '2011-05-09 07:16:12', 'Good', NULL, '2011-05-09 07:16:12', NULL, NULL, 9920149993, NULL, '3', 'Mumbai', '2011-02-22', 'asp.net', 'zapper320@gmail.com')
---
  def create
    @interview = Interview.new(params[:interview])

    # @interview.user_id = current_user.pidx

    respond_to do |format|
      if @interview.save

SELECT * FROM `interviews` WHERE (`interviews`.`id` = 2)
INSERT INTO `attachments` (`document_id`, `created_at`, `data_updated_at`, `updated_at`, `data_content_type`, `interview_id`, `data_file_name`, `data_file_size`) VALUES(NULL, '2011-05-10 09:44:55', '2011-05-10 09:44:55', '2011-05-10 09:44:55', 'application/vnd.ms-excel', 39, 'upload.csv', 149)
UPDATE `interviews` SET `phoneNumber` = 9452780718, `updated_at` = '2011-05-03 11:54:30', `remarks` = 'waiting', `email` = 'zapper320@gmail.com', `total_exp` = '5' WHERE `id` = 257
---
  def update

    @interview = Interview.find(params[:id])
    @attachment = Attachment.new(params[:attachment])
    @attachment.interview_id = @interview.id
    @attachment.save
    #    @attachment = @interview.attachments.each do |a|
    #      a.update_attributes(params[:attachment])
    #      end
    respond_to do |format|
      if @interview.update_attributes(params[:interview])

SELECT * FROM `interviews` WHERE (`interviews`.`id` = 3)
DELETE FROM `interviews` WHERE `id` = 3
---
  def destroy
    @interview = Interview.find(params[:id])
    @interview.destroy